# -*- coding: utf-8 -*-

ALPHABET = 'абвгдежзийклмнопрстуфхцчшщьыэюя'
INDEXES = {x: ind for ind, x in enumerate(ALPHABET)}
REV_INDEXES = {ind: x for ind, x in enumerate(ALPHABET)}

POPULAR_BIGRAMS = ['ст', 'по', 'то', 'па', 'ен']


def gcd(a, b):
    u = 0
    u_ = 1
    v = 1
    v_ = 0
    r = b
    r_ = a

    while r != 0:
        q = r_ // r
        r_, r = r, r_ - q * r
        u_, u = u, u_ - q * u
        v_, v = v, v_ - q * v
    return r_, u_, v_


def solve(a, b, m):
    d, u, v = gcd(a, m)
    if d == 1:
        return [(u * b) % m]
    elif d > 1:
        if b % d == 0 and m % d == 0:
            (_, u, v), m, b = gcd(a / d, m / d), int(m / d), int(b / d)
            x0 = (b * u) % m
            return [int(x0 + i * m) for i in range(int(d))]
        else:
            return []
    else:
        return []


def get_bigram_frequency(text):
    frequency = {}
    for idx, letter in enumerate(text[:-1:2]):
        if letter + text[idx*2 + 1] in frequency.keys():
            frequency[letter + text[idx*2 + 1]] += 1
        else:
            frequency[letter + text[idx*2 + 1]] = 1

    return frequency


def is_text_real(text):

    imp_bigrams = ['аь','оь','уь','еь','эь','ыь','иь','юь','яь','ьь',"йь"]
    for b in imp_bigrams:
        if b in text: return False
    return True


def decode(X):
    return REV_INDEXES[X//len(ALPHABET)], REV_INDEXES[X%len(ALPHABET)]


def encode(bigram):
    if len(bigram) == 2:
        return INDEXES[bigram[0]] * len(ALPHABET) + INDEXES[bigram[1]]
    if len(bigram) == 1:
        return INDEXES[bigram[0]]
    return -1


def decrypt(encrypted, a, b):
    m=len(ALPHABET)**2

    decrypted = ''

    d,a_,m_ = gcd(a,m)
    for ind,letter in enumerate(encrypted[:-1:2]):
        Y = encode([encrypted[ind * 2], encrypted[ind * 2 + 1]])
        X = (a_*(Y-b)) % m
        decrypted += ''.join(decode(X))
    return decrypted


def find_keys(encrypted):
    keys = set()
    bigrams = get_bigram_frequency(encrypted)
    encrypted_popular_bigrams = [bigram for bigram, _ in sorted(bigrams.items(), key=lambda item: item[1], reverse=True)[:10]]

    print('TOP bigrams:')
    for i in encrypted_popular_bigrams:
        print(i,':',bigrams[i])
    m = len(ALPHABET)**2
    for x1 in POPULAR_BIGRAMS:
        X1 = encode(x1)
        for x2 in POPULAR_BIGRAMS:
            X2 = encode(x2)
            for y1 in encrypted_popular_bigrams:
                Y1 = encode(y1)
                for y2 in encrypted_popular_bigrams:
                    Y2 = encode(y2)

                    if not x1 == x2 and not y1 == y2:
                        possible_a = solve((X1 - X2) % m, (Y1 - Y2) % m, m)
                        for a in possible_a:
                            if not a == 0:
                                b = (Y1-a*X1)%m
                                keys.add((a,b))

    return keys


with open('06.txt', 'r', encoding='utf-8') as file:
    text = ''.join(file.readlines()).replace('\n','')
    keys = find_keys(text)

    for a,b in keys:
        decrypted = decrypt(text,a,b)
        if is_text_real(decrypted):
            print(a,b,decrypted)





# '''
# 711 412
# вид н_рушения встреч_ется ниболее ч_сто последствия могут быть самые рзные если похищен текст книги справочник н которую потрчены месяцы рботы десятков людей то
# для коллектив авторов это ктстроф и потери могут выржться в тысячах долларов однко если книга уже издн то достаточно лишь слегк пожуритьпохитителяирассказатьослучившемсявотделеновостейгзетыилипотелевидениюпохитительможетсделтькнигевеликолепнуюреклмуоченьважнуюинформциюоберегемуюотрскрытияпредствляютсведенияолюдяхисторииболезниписьмасостояниясчетоввбанкходнакопомнениюбольшогочислспецилистовугрозыличностисвведениемкомпьютеровосталисьнатомжеуровнеивтомжесостояниичтоидообширногоиспользованияэвмвведениевсовременноммиретуризмстновитсявсеболееважнойбыстроразвивющейсяотрсльюхозяйствадоходыоттуризмстановятсявжнойчстьювлютныхпоступленийвомногихстранахрзвитиетуризмаспособствуетростуобщественногопроизводстваулучшениюегоструктурыроступроизводительноститрудвомногихотрсляхэкономикидаженеимеющихктуризмупрямогоотношениямеждународноетуристскоепотреблениестимулируетмногочисленныеэкономическиепроцессыоткрывающиедополнительныерынкидляпродукциинетуристскихотрслейсоздаваятемсамымусловиядляростапроизводствавсеэтифакторыделютрзвитиеиндустриитуризмоченьважнымдлястрнспереходнымтипомэкономикиеономическиетрудностикоторыепереживютэтигосударствнемогутнескзтьсянуровнерзвитиятуризманоприэтомкждаястрнимеетвэтомотношениисвоюспецификуцельдннойрботырссмотретьипронлизировтьоргнизциютуристскойдеятельностивстрнеспереходнымтипомэкономикинапримеревенгриивнчлерссмтриваютсятеоретикометодическиеположенияисследовниязатемдетсяоценкрзличныхфакторовразвитияиндустриитуризмавенгрииприродноресурсныйкультурноисторическийиинфрструктурныйпотенциалкомплексноетуристскоерайонированиедлеепроводитсянлизсовременногосостоянияиндустриитуризмвенгрииееотдельныхкомпонентовнафонеобщегоуровняэкономическогоразвитиястраныдаетсяоценкасоцильноэкономическойролииндустриитуризмавэкономикевенгрииивзключениепроводитсяобщийнлизорганизациитуристскойдеятельностивстранахспереходнымтипомэкономикивобщемивенгриивчстностивенгияприндлежакстрнмспереходнымтипомэкономикиимееттемнеменееспецифическиечертыкоторыеотличютееотдругихстрнэтоготипвотношениирзвитияиндустриитуризмосновнойткойчертойявляетсяточтотуризмвенгрииразвиветсяужедавноешевнчледвадцтоговеквэтойстранесложилисьтрадиционныетуристскиесвязитуризмявляетсяважнойотрасльюнародногохозяйствасовременнойвенгрииколичествоинострнныхтуристовпосещющихвенгриюрастетизгодавгодтомунемалоспособствуетбогатейшийкультурноисторическийиприрод
# None
# '''


'''
441 310 
утро было тихое город окутанный тьмой мирно нежился в постели пришло лето и ветер был летний теплое дыхание мира неспешное и ленивое стоит лишь встать высунуться
в окошко и тотчаспоймешьвотонаначинаетсянастоящаясвободаижизньвотонопервоеутролетадуглассполдингдвенадцатилетотродутолькочтооткрылглазаикаквтеплуюречкупогрузилсявпредрассветнуюбезмятежностьонлежалвсводчатойкомнаткеначетвертомэтажевовсемгороденебылобашнивышеиоттогочтоонпарилтаквысоковвоздухевместесиюньскимветромвнемрождаласьчудодейственнаясилапоночамкогдавязыдубыикленысливалисьводнобеспокойноеморедугласокидывалеговзглядомпронзавшимтьмуточномаякисегоднявотздоровошепнулонвпередицелоелетонесчетноемножестводнейчутьнеполкалендаряонужевиделсебямногорукимкакбожествошиваизкнижкипропутешествиятолькопоспевайрватьещезеленыеяблокиперсикичерныекакночьсливыегоневытащитьизлесуизкустовизречкиакакприятнобудетпомерзнутьзабравшисьвзаиндевелыйледниккаквеселожаритьсявбабушкинойкухнезаодностысячьюцыплятапоказаделоразвнеделюемупозволялиночеватьневдомикепососедствугдеспалиегородителиимладшийбратишкатомаздесьвдедовскойбашнеонвзбегалпотемнойвинтовойлестниценасамыйверхиложилсяспатьвэтойобителикудесникасредигромовивиденийаспозаранкукогдадажемолочникещенезвякалбутылкаминаулицахонпросыпалсяиприступалкзаветномуволшебствустоявтемнотеуоткрытогоокнаоннабралполнуюгрудьвоздухаиизовсехсилдунулуличныефонаримигомпогаслиточносвечкиначерномименинномпирогедугласдунулещеиещеивнебеначалигаснутьзвездыдугласулыбнулсяткнулпальцемтамитамтеперьтутивоттутвпредутреннемтуманеодинзадругимпрорезалисьпрямоугольникивдомахзажигалисьогнидалекодалеконарассветнойземлевдругозариласьцелаявереницаоконвсемзевнутьвсемвставатьогромныйдомвнизуожилдедушкавынимайзубыизстаканадугласнемногоподождалбабушкаипрабабушкажарьтеоладьисквознякпронесповсемкоридорамтеплыйдухжареноготестаивовсехкомнатахвстрепенулисьмногочисленныететкидядьядвоюродныебратьяисестрычтосехалисьсюдапогоститьулицастариковпросыпайсямиссэленлумисполковникфрилеймиссисбентлипокашляйтевстаньтепроглотитесвоитаблеткипошевеливайтесьмистерджонасзапрягайтелошадьвыводитеизсараяфургонпораехатьзастарьемпотусторонуоврагаоткрылисвоидраконьиглазаугрюмыеособнякискоровнизупоявятсянаэлектрическойзеленоймашинедвестарухиипокатятпоутреннимулицамприветственномахаякаждойвстречнойсобакемистертридденбегитевтрамвайноедепоивскорепоузкимрусламмощеныхулицпоплыветтрамвайрассыпаявокругжаркиесиниеискрыджонхафчарливудменвыготовышепнулдугласулицедетейготовыспросилонубейсбольныхмячейчтомоклинаросистыхлужайкахупустыхверевочныхкачелейчтоскучаясвисалисдеревьевмампаптомпроснитесьтихонькопрозвенелибудильникигулкопробиличасыназданиисудаточносетьзаброшеннаяегорукойсдеревьеввзметнулисьптицыизапелидирижируясвоиморкестромдугласповелительнопротянулрукуквостокуивзошлосолнцедугласскрестилрукинагрудииулыбнулсякакнастоящийволшебниквоттотодумалонтолькояприказаливсеповскакаливсезабегалиотличноебудетлетоионнапоследокогляделгородищелкнулемупальцамираспахнулисьдверидомовлюдивышлинаулицулетотысячадевятьсотдвадцатьвосьмогогоданачалосьвтоутропроходяполужайкедугласнаткнулсянапаутинуневидимаянитькоснуласьеголбаинеслышнолопнулаиотэтогопустячногослучаяоннасторожилсяденьбудетнетакойкаквсенетакойещеипотомучтобываютднисотканныеизоднихзапаховсловновесьмирможновтянутьносомкаквоздухвдохнутьивыдохнутьтакобяснялдугласуиегодесятилетнемубратутомуотецкогдавезихвмашинезагородавдругиедниговорилещеотецможноуслышатькаждыйгромикаждыйшорохвселеннойиныеднихорошопробоватьнавкусаиныенаощупьабываютитакиекогдаестьвсесразувотнапримерсегодняпахнеттакбудтоводнуночьтамзахолмаминевестьоткудавзялсяогромныйфруктовыйсадивседосамогогоризонтатакиблагоухаетввоздухепахнетдождемнонанебениоблачкатогоиглядиктотоневедомыйзахохочетвлесунопокатамтишинадугласвовсеглазасмотрелнаплывущиемимополянетнисадомнепахнетнидождемдаиоткудабыразнияблоньнетнитучиктотамможетхохотатьвлесуавсетакидугласвздрогнулденьэтоткакойтоособенныймашинаостановиласьвсамомсердцетихоголесаануребятанебаловатьсяониподталкивалидругдругалоктямихорошопапамальчикивылезлиизмашинызахватилисиниежестяныеведраисойдяспустыннойпроселочнойдорогипогрузилисьвзапахиземливлажнойотнедавнегодождяищитепчелсказалотецонивсегдавьютсявозлевиноградакакмальчишкивозлекухнидугласдугласвстрепенулсяопятьвитаешьвоблакахсказалотецспустисьназемлюпойдемснамихорошопапаионигуськомпобрелиполесувпередиотецрослыйиплечистыйзанимдугласапоследнимсеменилкоротышкатомподнялисьнаневысокийхолмипосмотреливдальвонтамуказалпальцемотецтамобитаютогромныеполетнемутихиеветрыинезримыеплывутвзеленыхглубинахточнопризрачныекитыдугласглянулвтусторонуничегонеувиделипочувствовалсебяобманутымотецкакидедушкавечноговоритзагадкамииивсетакидугласзатаилдыханиеиприслушалсячтотодолжнослучитьсяподумалоняужзнаюавотпапоротникназываетсявенеринволосотецнеторопливошагалвпередсинееведропозвякивалоунеговрукеаэточувствуетеионковырнулземлюноскомбашмакамиллионылеткопилсяэтотперегнойосеньзаосеньюпадалилистьяпоказемлянесталатакоймягкойухтыяступаюкакиндеецсказалтомсовсемнеслышнодугласпотрогалземлюноничегонеощутилонвсевремянастороженноприслушивалсямыокруженыдумалончтотослучитсяночтооностановилсявыходижегдетытамчтотытакоемысленнокричалонтомиотецшлидальшепотихойподатливойземленасветенеткружеватоньшенегромкосказалотеципоказалрукойвверхгделиствадеревьеввплеталасьвнебоилиможетбытьнебовплеталосьвлиствувсеравноулыбнулсяотецвсеэтокружевазеленыеиголубыевсмотритесьхорошенькоиувидителесплететихсловногудящийстанокотецстоялувереннопохозяйскиирассказывалимвсякуювсячинулегкоисвободноневыбираясловчастоонисамсмеялсясвоимрассказамиотэтогоонитеклиещесвободнеехорошоприслучаепослушатьтишинуговорилонпотомучтотогдаудаетсяуслышатькакноситсяввоздухепыльцаполевыхцветовавоздухтакигудитпчеламидадатакигудитавотслышитетамзадеревьямиводопадомльетсяптичьещебетаньевотсейчасдумалдугласвотоноужеблизкоаяещеневижусовсемблизкорядомдикийвиноградсказалотецнамповезлосмотритеканенадоахнулпросебядугласнотомиотецнаклонилисьипогрузилирукившуршащийкустчарырассеялисьтопугающееигрозноечтоподкрадывалосьблизилосьготовобылоринутьсяипотрястиегодушуисчезлоопустошенныйрастерянныйдугласупалнаколенипальцыегоушлиглубоковзеленуютеньивынырнулиобагренныеалымсокомсловноонвзрезаллесножомисунулрукивоткрытуюранумальчикизавтракатьведрачутьнедоверхунаполненыдикимвиноградомилеснойземляникойвокруггудятпчелыэтововсенепчелыацелыймиртихонькомурлычетсвоюпесенкуговоритотецаонисидятназамшеломстволеупавшегодереважуютсандвичиипытаютсяслушатьлескакслушаетонотецчутьпосмеиваясьискосапоглядываетнадугласахотелбылочтотосказатьнопромолчалоткусилещекусоксандвичаизадумалсяхлебсветчинойвлесунеточтодомавкуссовсемдругойверноостреечтолимятойотдаетсмолойаужаппетиткакразыгрываетсядугласпересталжеватьипотрогалязыкомхлебиветчинунетнетобыкновенныйсандвичтомкивнулпродолжаяжеватьяпонимаюпапведьужепочтислучилосьдумаетдугласнезнаючтоэтоноонобольшущеепрямогромадноечтотоегоспугнулогдежеонотеперьопятьушловтоткустнетгдетозамнойнетнетздесьтутрядомдугласисподтишкапощупалсвойживотоноещевернетсянадотольконемножкоподождатьбольнонебудетяужзнаюнезатемонокомнепридетнозачемжезачема
'''


