# -*- coding: utf-8 -*-
import random
import pandas

ALPHABET = "абвгдежзийклмнопрстуфхцчшщъыьэюя"
INDEXES = {x:i for i,x in enumerate(ALPHABET)}
REVERSED_INDEXES = {i:x for i,x in enumerate(ALPHABET)}
RUSSIAN_INDEX = 0.0553

ALPHABET_LENGTH = len(ALPHABET)


def __concat_dict(initial, with_):
    for k in with_.keys():
        if k in initial.keys():
            initial[k] +=  with_[k]
        else:
            initial[k] = with_[k]

    return initial

def __get_random_string(n):
    s = ''
    for i in range(n):
        s += ALPHABET[int(random.random()*len(ALPHABET))]
    return s


def __get_frequency(text):
    frequency = {x:0 for x in ALPHABET}
    for l in text:
        frequency[l] += 1
    return frequency


def __gen_reference(r):
    with open('ref.txt', 'r',encoding='UTF-8') as file:
        raw = file.read()
        key = __get_random_string(r)
        encrypted = encrypt(raw,key)

    buckets = split(encrypted, r)
    ind = []
    for b in buckets:
        ind.append(calc_i(b)[0])

    return calc_i(encrypted)[0]


def encrypt(text, key):
    encrypted = ""
    key_length = len(key)
    text_length = len(text)
    for i in range(text_length):
        encrypted += ALPHABET[(INDEXES[text[i]]+INDEXES[key[i%key_length]])%ALPHABET_LENGTH]

    return encrypted


def get_key(encrypted, r ,X):
    key = ''
    buckets = split(encrypted,r)

    for ind,b in enumerate(buckets):

        f = __get_frequency(b)
        # print('f:',f)
        y = max(f, key=lambda x: f[x])
        # print('y:',y)
        y = INDEXES[y]
        key += REVERSED_INDEXES[(y-X)%ALPHABET_LENGTH]

    return key


def decrypt(encrypted, key):
    decrypted = ""
    key_length = len(key)
    text_length = len(encrypted)
    for i in range(text_length):
        decrypted += ALPHABET[(INDEXES[encrypted[i]] - INDEXES[key[i % key_length]]) % ALPHABET_LENGTH]

    return decrypted


def split(text, n):
    buckets = ['']*n
    for i,l in enumerate(text):
        buckets[i%n] += l

    return buckets


def calc_i(text):
    frequency = __get_frequency(text)
    ind = 0
    for n in frequency.values():
        ind += n * (n - 1)
    ind /= len(text) * (len(text) - 1)
    mi = MI(frequency, len(text))
    return ind, mi


def MI(frequency, text_len):
    mi = 0
    for f in frequency.values():
        mi += (f/text_len)**2

    return mi


def calc_index_agl1(encrypted, r):
    buckets = split(encrypted, r)
    i = []
    mi=[]
    for b in buckets:
        ind_,mi_ = calc_i(b)
        i.append(ind_)
        mi.append(mi_)
    print('\nr:', r)
    print('I(Y):', i)
    print('MI(Y):', mi)
    print('AVG:\n    I(Y):', sum(i)/r,'\n    MI(Y):', sum(mi)/r)
    return {'r': [r], 'Average I(Y)': [sum(i) / r], 'Average MI(Y)': [sum(mi) / r], 'RUSSIAN INDEX':[RUSSIAN_INDEX]}


def calc_index_alg2(encrypted, r):
    ref = __gen_reference(r)
    # buckets = split(encrypted, r)
    # ind = []
    # for b in buckets:
    #     ind.append(calc_i(b)[0])
    ind = calc_i(encrypted)[0]
    print('\nr:',r)
    print('    ref:',ref)
    print('    i:',ind)
    # print('AVG:','\n    REF:',sum(ref)/r,'\n    I:',sum(ind)/r)
    return {'r':[r], 'Reference value':[ref],'Average I(Y)':[ind]}



def Dr(encrypted,r):
    dr = 0
    for i in range(len(encrypted[:-r])):
        if encrypted[i]==encrypted[i+r]:
            dr += 1;
    print('r:', r, 'dr:', dr)
    return {"r":[r], "Dr":[dr]}


with open('ref.txt','r',encoding='utf-8') as file:
    ref_txt = file.read()
    print('I(initial text)', calc_i(ref_txt)[0])

keys = [
    'да',
    'код',
'шифр',
'лабки',
'пароль',
'пампушечка',
'паралингвистика',
'паровозостроительный'

]

p1 = {}

for key in keys:
    encrypted = encrypt(ref_txt,key)
    ind = calc_i(encrypted)[0]
    res = {'r':[len(key)],'key':[key], 'I(Y)':[ind]}
    p1 = __concat_dict(p1,res)
    print('r=', len(key),'key=',key, 'I(encrypted)=', ind)

df = pandas.DataFrame(data=p1)
df.to_excel('indexes.xlsx', header='Calculated I(Y) for referent text')


with open('encrypted.txt', 'r', encoding='utf-8') as file:
    encrypted = file.read().replace('\n', '')

    alg2={}
    alg1={}
    dr={}

    for i in range(2,7):
        alg2 = __concat_dict(alg2 , calc_index_alg2(encrypted,i))

    df = pandas.DataFrame(data=alg2)
    df.to_excel('alg2.xlsx', header='Calculated I(Y) by second algorithm')

    for i in range(7,30):
        alg1 = __concat_dict(alg1 , calc_index_agl1(encrypted,i))

    df = pandas.DataFrame(data=alg1)
    df.to_excel('alg1.xlsx', header='Calculated I(Y) by first algorithm')

    for i in range(2,30):
        dr = __concat_dict(dr , Dr(encrypted,i))

    df = pandas.DataFrame(data=dr)
    df.to_excel('dr.xlsx', header='Calculated Dr(Y)')

    suggested = int(input('Enter suggested r: '))

    for k in ['о', 'е', 'и']:
        key = get_key(encrypted, suggested, INDEXES[k])
        print(key)

    key = input('Enter suggested key: ')
    decrypted = decrypt(encrypted, key)
    with open('decrypted.txt', 'w', encoding='utf-8') as dec:
        dec.write(decrypted)



"""

"""

"""
дорофей львович пивторы кобылы ниразу в жизни не покидал земли хотя прожил уже больше шестидесяти лет работал прорабом строительной
 компании домострой в харькове столице вкраины любил порыбачить с друзьями на озерах роганьского края зачертой города выращивал на
  дачном участке овощи и фрукты воспитывал внуков а вот уезжать за пределы родной вкраины не любил не смотря на возможности 
  всвязиссозданиемглобальнойсетиметропобыватьналюбойпланетесолнечнойсистемыидажезаеепределамичтоподвиглоегосогласитьсянаэкскурсиюполунеонисамневсостояниибылответитьвероятносыгралисвоюрольрассказыдрузейхваставшихсясвоимипутешествиямииунеговзыгралолюбопытствопосмотретьвблизичтожеэтотакоеспутницаземлиокоторойтакмногоговорятдетивнукиидрузьякакбытонибылоаутромдвадцатьтретьегодекабряаккуратвначалосвятокдорофейльвовичвтайнеотродныхиблизкихпозвонилвбюроэкскурсийсолнечнойсистемызапинаясьобъяснилчегохочетивтотжеденьспомощьюметродобралсядоаполлонтаунагороданалунеоткудадолжнабыланачатьсяэкскурсияпосамымкрасивымизагадочнымместамспутницыземлиаполлонтаунрасполагалсянаравнинеморяспокойствиянедалекоотзнаменитойбороздымаскелайнпохожейнаиизвилистоеруслорекиименноздеськогдатовконцедвадцатоговекасовершилпосадкуамериканскийпилотируемыйкорабльаполлонодиннадцатьаточнееегопосадочныймодульестественноэкскурсантамзанимавшимкабинудвадцатиместногоэкскурсионногофлайтасначалапоказалипамятникаполлонуодиннадцатьпирамидуизлунногобазальтаспосадочнойплатформойиамериканскимфлагомазатемфлайтотправилсявпутешествиепоморюспокойствиязалитомуяркимсолнечнымсветомэкскурсантамиоказалисьмолодыелюдиввозрастеотвосемнадцатидодвадцатилетпоэтомупоначалудорофейльвовиччувствовалсебяневсвоейтарелкесмущаясьподлюбопытнымивзглядамиспутниковнопотомегозахватиласуроваякрасоталунныхпейзажейионпересталобращатьвниманиенавеселящуюсякомпаниюжадноразглядываяпроплывающиеподднищемфлайтациркиэскарпыкратерыиживописныегруппыскалмореспокойствияполучилосвоеназваниенеслучайноегоровнаясглаженнаяповерхностьтипичнадляобширныхморейнадневнойсторонелуныиредкорадуетнаблюдателейпроявлениемвулканическойдеятельностиоднакоиздесьимелосьнемалоинтересныхместиобъектовкоторыедесяткилетволновалиастрономовизучающихспутницуземлизагадочнаяцепочкакратеровподназваниемтенниснаяракеткаоколодвухдесятковямокдиаметромотпятидесятидостаметровпротянулисьудивительноровнойлиниейзаканчиваяськратеромпобольшедиаметромоколошестисотметроввпечатлениескладываетсятакоебудтополуннойповерхностидействительнопрокатилсяподпрыгиваятеннисныймячоставиввпылицепочкуследовсовиныймосткаменнаяаркачерезбороздумаскелайндлинойоколотрехкилометровизумительноровнаястенаобрывадлинойоколотридцатикилометромбудтоктотоотхватилножомкусоклуннойповерхностиивыбросилвкосмосоставивсрезиложбинуглубинойвкилометрбороздазолотойручейсамоенастоящееруслорекиширинойвполторакилометраидлинойвполторастасверкающееподлучамисолнцакристалликамипиритацветочнаяклумбавозвышениерыхлойпородыоранжевогоцветадиаметромоколодвухкилометровивысотойвдвестиметровдействительноклумбаеслипосмотретьсверхустоунхенджгруппаскалсплоскимивершинамисоединенныхповерхудостаточноровнымиплитамипрактическинеотличаетсяотземногомегалитическогокомплексаванглииинаконецбороздамаскелайндлинойоколочетырехсоткилометровтакжездоровопохожаянаруслорекиширинойоткилометрадотрехкакобъяснилгидборозданасамомделепредставляетсобойсдвиговыйразломлуннойкорыслучившийсядесяткимиллионовлетназадврезультатеподвижкищитаотудараметеоританосверхубороздавсеравнонапоминаетрекуидорофейльвовичдажепредставилкакпоруслутечетводаостанавливалисьивыходилиизфлайтаодетыевпузыривакуумплотныхспецкостюмовнесколькоразвкабинеаппаратаподдерживаласьнормальнаясилатяжестипочтиземнаяавнееецарилолунноетяготениевшестьразслабееземногопоэтомунеобошлосьбезкурьезовинеловкихдвиженийправдавсевконцеконцовпривыкликнеобычайнойлегкостивтелеисудовольствиемскакалипоместнымбуеракамвтомчислеидорофейльвовичполучившийнисчемнесравнимыеощущенияатеперьявампокажуобъектзеросказалгидприглашаяэкскурсантоввкабинупослеочередноговыходанаружуходятлегендычтовэтомместенаглубинедвухсотметроврасполагалсязагадочныйшаризкотороговпоследствиивылупилсяназемлебоевойгиперптеридскийроботдемонавторитетнымтономзаметилктотоизкомпаниимолодыхлюдейилиджиннсовершенноверноноведьонпотомоставилвкольцахсатурнасвоюикрубриллиантидыэтоужедругаяисториявынаверноепомнитевойнасджиннамизакончиласьвсеголишьгодназадаздесьосталсяследдемоначтовнеминтересногоувидитефлайтспрозрачнымидосамогополастенкамиподнялсянадкратеромаваковаипонессякгоризонтусвисящейнаднимпочтиполнойземлейокрашивающейравнинувголубоватыйцветвместахгдележалатеньотскалосвещенныхпрямымисолнечнымилучамиприблизиласьрекабороздымаскелайнраздаласьвширьпревратиласьвкрутойглубинойдокилометраканьоннаодномизплоскихгребнейканьонапоявилосьбелосеребристоепятнышкопревратилосьвхолмикзатемвгорусдыройвцентрефлайтзависвпарекилометровотэтойстраннойгорыиэкскурсантыначалирассматриватьобъектимевшийнеобычноеназваниезеробольшевсегосеребристыйкуполскратеромдиаметромвтрикилометранапоминалчеловеческийглазрадужкакотороговысохлаипожухлапревратившисьвбелоснежныйслоймхаивызывалэтотглазотнюдьнеприятныеирадостныеощущениянеомерзениенетноиневосторгслишкоммноговэтомзрелищебылопугающегоиотталкивающегоиодновременнопритягивающеговзормолодежьпритихладорофейльвовичпочувствовалстеснениевгрудипосмотрелнагидатотулыбнулсякакнастоящийчеловекхотябылвсегонавсеговитсомнравитсячтоэтотакоеэффектквантовойэффузиикакговорятученыеобразноговорянагорныепородыподействовалодыханиедемонанаэтомместеболеедвухсотлетназаднаходилсяториевыйрудникшахтакоторогодостиглашаровиднойполостигдеиспалджинннепосредственнокшахтенаснепропуститохрананотутрядоместьинтересноеущельеонообразовалосьсовсемнедавновсегодвамесяцаназадимыможемполюбоватьсянарудниксобрываполетелиздоровооченьинтересномыхотимпрогулятьсяраздалисьголосадорофейльвовичхотяинеиспытывалбольшежеланиягулятьоднаковозражатьнесталунеговозниклоощущениечтоонздесьужебылкогдатохотяникогдараньшелунунепосещалфлайтоблетелснежносеребристыйглазбывшеготориевогорудникакругомповернулвдольбороздымаскелайнкюгуснизилсясталивиднытрещиныразорвавшиебоковыестенкибороздысовсемсвежиесудяпоблескуузкиеипоширеочевидноэтобылрезультатнедавнеголунотрясенияокоторомговорилгидприблизиласьочереднаятрещинадействительнообразовавшаяживописноеущельесослоистымистенамифлайтподпрыгнулиселнаобрывескоторогобылихорошовидныкуполобъектазероибороздамаскелайнэкскурсантыпосыпалисьизаппаратарадуясьвозможностиразмятьсягурьбойнаправилиськобрывуперебрасываясьшуточкамиидурачасьвнихигралащенячьяэнергиямолодостиидорофейльвовичнамгновениепозавидовалзадоруиоптимизмуюношейидевушекгодящихсяемучутьлиневовнукионтожеполюбовалсянаснежнобелыйкуполвтрехкилометрахотобрывапотомтихонькоотошелотрезвящихсямолодыхлюдейипрошелсявдольобрывавглядываясьвпротивоположнуюстенуущельявзгляднаткнулсянарядчерныхотверстийпохожихнаследыпулеметнойочередизаинтересовавшисьдорофейльвовичпрыгнулвнизивключивантигравпересекущельеопустилсянаузкийкарнизпередсамойбольшойдыройопредупреждениигиданеотходитьдалекоотфлайтаонзабылдыраоказаласьвходомвпещеру
"""
